{
    "architectures": [
        "SKTOmniForConditionalGeneration"
    ],
    "auto_map": {
        "AutoConfig": "configuration_skt_omni.SKTOmniConfig",
        "AutoModel": "modeling_skt_omni.SKTOmniForConditionalGeneration",
        "AutoModelForCausalLM": "modeling_skt_omni.SKTOmniForConditionalGeneration",
        "AutoTokenizer": "tokenization_SKT_AI.TikTokenTokenizer"
    },
    "developer": "Shrijan Kumar Tiwari",
    "num_parameters_formatted": "1.1 Trillion (1.1T)",
    "num_parameters": 1100000000000,
    "bos_token_id": 163584,
    "dtype": "bfloat16",
    "eos_token_id": 163585,
    "ignore_index": -100,
    "media_placeholder_token_id": 163605,
    "model_type": "skt_omni_supreme",
    "pad_token_id": 163839,
    "text_config": {
        "_name_or_path": "SKT-AI-LABS/OMNI-SUPREME-1.1T",
        "add_cross_attention": false,
        "architectures": [
            "SKTOmniTextForCausalLM"
        ],
        "attention_bias": false,
        "attention_dropout": 0.05,
        "aux_loss_alpha": 0.01,
        "bos_token_id": 163584,
        "eos_token_id": 163585,
        "hidden_act": "silu",
        "hidden_size": 8192,
        "initializer_range": 0.015,
        "intermediate_size": 28672,
        "max_position_embeddings": 524288,
        "model_type": "skt_omni",
        "num_hidden_layers": 80,
        "num_attention_heads": 64,
        "num_key_value_heads": 8,
        "rms_norm_eps": 1e-05,
        "vocab_size": 163840,
        "moe_config": {
            "num_experts": 128,
            "num_experts_per_tok": 2,
            "moe_intermediate_size": 10240,
            "expert_parallel_size": 8,
            "router_type": "top-2-gating",
            "z_loss_coeff": 0.01,
            "capacity_factor": 1.25
        },
        "rope_scaling": {
            "type": "yarn",
            "factor": 64.0,
            "original_max_position_embeddings": 4096
        },
        "rope_theta": 100000.0,
        "transformers_version": "4.56.2",
        "use_cache": true
    },
    "vision_config": {
        "_attn_implementation": "flash_attention_2",
        "mm_hidden_size": 1152,
        "mm_projector_type": "patchmerger",
        "patch_size": 14,
        "video_attn_type": "spatial_temporal",
        "vt_num_hidden_layers": 27,
        "vision_tower_id": "google/siglip-so400m-patch14-384"
    },
    "tie_word_embeddings": false,
    "use_unified_vision_chunk": true,
    "video_placeholder": "<|skt_omni_video_placeholder|>",
    "st_x_framework_version": "1.0.6-extreme"
}
