{
  "add_bos_token": true,
  "add_eos_token": false,
  "added_tokens_decoder": {
    "163584": {
      "content": "<|begin_of_text|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false
    },
    "163585": {
      "content": "<|end_of_text|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false
    },
    "163839": {
      "content": "<|pad_text|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false
    }
  },
  "bos_token": "<|begin_of_text|>",
  "clean_up_tokenization_spaces": true,
  "eos_token": "<|end_of_text|>",
  "model_max_length": 262144,
  "pad_token": "<|pad_text|>",
  "tokenizer_class": "TikTokenTokenizer",
  "chat_template": "{% for message in messages %}{{'<|' + message['role'] + '|>\\n' + message['content'] + '<|end_of_text|>\\n'}}{% endfor %}",
  "developer": "Shrijan Kumar Tiwari",
  "project": "Project Surya 1.1T OMNI SUPREME",
  "framework": "ST-X Extreme v1.0.6"
}
